import React, {Component} from 'react';
import {connect} from 'react-redux';
import {bindActionCreators} from 'redux';
import * as homeActions from '../redux/reduces/home';
import '../style/illustration.scss';

@connect(
  state => ({home: state.home}),
  dispatch => bindActionCreators(homeActions, dispatch)
)

class Clause extends Component {
  render() {
    return (
      <div className="illustration">
        <div className="clause">
          <h3>非凡网的私隐声明</h3>
          <p>非凡网致力遵守《个人资料（私隐）条例》的规定，以保护我们所持个人信息的隐私、保密及安全。
            因此，非凡网已采取以下政策，以保障网络用户的个人信息，并承诺把信息保密。
            非凡网收集和使用的个人信息，只限于直接与收集声明所载用途或活动相关的目的。</p>
          <h3>个人信息的收集</h3>
          <p>非凡网仅基于自愿性质向网络用户收集个人信息。个人信息可包括姓名、电邮地址等。
            非凡网收集的个人信息只用于非凡网及其关联公司作市场宣传用途。
            非凡网不会在未取得您事先同意的情况下，向其他机构出售、出租或发送个人信息。</p>
          <p>非凡网或会通过电邮发送电子报及其他通讯［及定期邮件］。
            除非您已订阅这些通讯，否则我们不会向您发出这些通讯。
            此外，如您主动与我们联系，我们可能会使用您的个人信息联络您。
            例如：如您向我们发送电子邮件，我们可能会使用您提供的联系信息回复您。</p>
          <h3>Cookies</h3>
          <p>非凡网使用cookies追踪和收集用户浏览非凡网网站的一般信息，
            例如姓名、电邮及个人兴趣等，以用作数据分析及市场宣传用途。
            您可以通过浏览器的功能选单（选项清单）禁用cookies功能，或删除现有的cookies。</p>
          <h3>储存及存取</h3>
          <p>非凡网将您提供的所有个人信息储存在非凡网受存取限制的伺服器。
            非凡网保留权利聘用受严格保密指引约束的代理人负责执行储存和处理信息的工作。
            只有需要执行合法行动／用途的指定雇员或代理人才可查阅您的个人信息。
            违反非凡网私隐政策的雇员或代理人将会受到纪律处分或法律追究。</p>
          <h3>允许披露个人信息的情况</h3>
          <p>除非获得您的同意，根据法例要求，或就司法调查或政府调查或诉讼所需，
            否则非凡网不会向第三方披露任何个人信息。
            非凡网亦保留权利为所需目的披露及使用个人信息，
            这些目的包括：保护我们的所有权、保障客户、员工或财产的安全、
            出售或转让我们的部分或全部资产，或当我们真诚地相信法例要求我们如此行事。</p>
          <h3>查阅个人信息的权利</h3>
          <p>如果您想获取您的个人信息副本，或想从我们的资料库中删除或修改您的个人信息，
            请电邮至support@非凡网.com通知非凡网。</p>
          <h3>与其他网站的连结</h3>
          <p>非凡网网站提供接达其他网站的连结，
            而非凡网已致力以仅提供采取与非凡网相若严格的标准和私隐尊重之网站的连结。
            然而，非凡网不会就其他网站的内容或其采取的私隐措施承担责任。</p>
          <h3>拒绝接收更多邮件的选择</h3>
          <p>假如您不想继续收到我们的电子报或其他通讯，您可随时透过以下途径，选择不再接收我们的信息：</p>
          <p>1. 电邮：support@17fifa.com</p>
        </div>
      </div>
    );
  }
}

export default Clause;
